enhancements in 1C/Файлы расширений/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛБ_Гуид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛБ_ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

enhancements in 1C/Файлы расширений/Documents/ЗаказКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЛБ_СообщитьГуидИДатуПослеНаСервере()
	
	ДокументОбъект 			= Объект.Ссылка.ПолучитьОбъект();
	ТекСтрокаДляВозврата 	= Строка(ДокументОбъект.ЛБ_Гуид) + " - " + Строка(ДокументОбъект.ЛБ_ДатаИзменения) + " это гуид через объект"+Символы.ПС;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ССылка", Объект.Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиента.ЛБ_Гуид КАК ЛБ_Гуид,
	               |	ЗаказКлиента.ЛБ_ДатаИзменения КАК ЛБ_ДатаИзменения
	               |ИЗ
	               |	Документ.ЗаказКлиента КАК ЗаказКлиента
	               |ГДЕ
	               |	ЗаказКлиента.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	ДопСтрокаДляВозврата = "";
	
	Если Выборка.Следующий() Тогда
		
		ДопСтрокаДляВозврата 	= Строка(Выборка.ЛБ_Гуид) + " - " + Строка(Выборка.ЛБ_ДатаИзменения) + " это гуид через запрос"+Символы.ПС;	
		
	КонецЕсли;
	
	ТекСтрокаДляВозврата = ТекСтрокаДляВозврата + ДопСтрокаДляВозврата;
	Сообщить(ТекСтрокаДляВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛБ_СообщитьГуидИДатуПосле(Команда)
	ЛБ_СообщитьГуидИДатуПослеНаСервере();
КонецПроцедуры
